Merge pull request #6969 from pollinations/patch/github-profile-arch
[PATCH]: Use Mermaid diagrams instead of ASCII for the Pollinations Unified Architechture
